{"format": "graph-model", "generatedBy": "2.3.0", "convertedBy": "TensorFlow.js Converter v3.0.0", "signature": {"inputs": {"input:0": {"name": "input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "10"}]}}}, "outputs": {"outmax:0": {"name": "outmax:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}}}, "modelTopology": {"node": [{"name": "input", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "10"}]}}}}, {"name": "fc1/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}, {"size": "12"}]}}}}}, {"name": "output/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "12"}, {"size": "3"}]}}}}}, {"name": "outmax/dimension", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "fc1/MatMul", "op": "MatMul", "input": ["input", "fc1/kernel"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "fc1/Relu", "op": "Relu", "input": ["fc1/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "output/MatMul", "op": "MatMul", "input": ["fc1/Relu", "output/kernel"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "output/Softmax", "op": "Softmax", "input": ["output/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "outmax", "op": "ArgMax", "input": ["output/Softmax", "outmax/dimension"], "attr": {"output_type": {"type": "DT_INT64"}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}], "library": {}, "versions": {}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "fc1/kernel", "shape": [10, 12], "dtype": "float32"}, {"name": "output/kernel", "shape": [12, 3], "dtype": "float32"}, {"name": "outmax/dimension", "shape": [], "dtype": "int32"}]}]}