{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v3.0.0", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 5, 1], "ragged": false, "sparse": false, "name": "lstm_4_input"}}, {"class_name": "LSTM", "config": {"trainable": true, "implementation": 2, "go_backwards": false, "return_state": false, "dropout": 0.0, "return_sequences": true, "recurrent_dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "unroll": false, "recurrent_activation": "sigmoid", "bias_constraint": null, "name": "lstm_4", "activation": "tanh", "units": 128, "batch_input_shape": [null, 5, 1], "kernel_regularizer": null, "recurrent_constraint": null, "recurrent_regularizer": null, "unit_forget_bias": true, "time_major": false, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": false, "dtype": "float32", "kernel_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "name": "dropout_6", "rate": 0.2, "noise_shape": null, "dtype": "float32"}}, {"class_name": "LSTM", "config": {"trainable": true, "implementation": 2, "go_backwards": false, "return_state": false, "dropout": 0.0, "return_sequences": false, "recurrent_dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "unroll": false, "recurrent_activation": "sigmoid", "bias_constraint": null, "name": "lstm_5", "activation": "tanh", "units": 96, "kernel_regularizer": null, "recurrent_constraint": null, "recurrent_regularizer": null, "unit_forget_bias": true, "time_major": false, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": false, "dtype": "float32", "kernel_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "name": "dropout_7", "rate": 0.2, "noise_shape": null, "dtype": "float32"}}, {"class_name": "Dense", "config": {"trainable": true, "bias_constraint": null, "name": "dense_4", "activation": "linear", "units": 96, "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dtype": "float32", "kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "name": "dropout_8", "rate": 0.2, "noise_shape": null, "dtype": "float32"}}, {"class_name": "Dense", "config": {"trainable": true, "bias_constraint": null, "name": "dense_5", "activation": "linear", "units": 1, "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dtype": "float32", "kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}}}, {"class_name": "Activation", "config": {"activation": "sigmoid", "trainable": true, "name": "activation_2", "dtype": "float32"}}], "name": "sequential_2"}}, "training_config": {"metrics": ["accuracy"], "weighted_metrics": null, "optimizer_config": {"class_name": "Adam", "config": {"amsgrad": false, "name": "Adam", "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "learning_rate": 0.0010000000474974513, "epsilon": 1e-07}}, "loss": "mse", "loss_weights": null}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "dense_4/kernel", "shape": [96, 96], "dtype": "float32"}, {"name": "dense_4/bias", "shape": [96], "dtype": "float32"}, {"name": "dense_5/kernel", "shape": [96, 1], "dtype": "float32"}, {"name": "dense_5/bias", "shape": [1], "dtype": "float32"}, {"name": "lstm_4/lstm_cell_6/kernel", "shape": [1, 512], "dtype": "float32"}, {"name": "lstm_4/lstm_cell_6/recurrent_kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "lstm_4/lstm_cell_6/bias", "shape": [512], "dtype": "float32"}, {"name": "lstm_5/lstm_cell_7/kernel", "shape": [128, 384], "dtype": "float32"}, {"name": "lstm_5/lstm_cell_7/recurrent_kernel", "shape": [96, 384], "dtype": "float32"}, {"name": "lstm_5/lstm_cell_7/bias", "shape": [384], "dtype": "float32"}]}]}